---
kind: event
id: E:Autodesk.Revit.UI.ComboBox.CurrentChanged
source: html/9b786d54-6599-3bd9-f240-b27df8b03d1f.htm
---
# Autodesk.Revit.UI.ComboBox.CurrentChanged Event

Subscribe to this event to be notified when the current item of the ComboBox is changed.

## Syntax (C#)
```csharp
public event EventHandler<ComboBoxCurrentChangedEventArgs> CurrentChanged
```